GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k42.h
// Register: RD0I2C
#define RD0I2C RD0I2C
extern volatile unsigned char           RD0I2C              __at(0x3A7A);
#ifndef _LIB_BUILD
asm("RD0I2C equ 03A7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RD0I2Cbits_t;
extern volatile RD0I2Cbits_t RD0I2Cbits __at(0x3A7A);
// bitfield macros
#define _RD0I2C_TH_POSN                                     0x0
#define _RD0I2C_TH_POSITION                                 0x0
#define _RD0I2C_TH_SIZE                                     0x2
#define _RD0I2C_TH_LENGTH                                   0x2
#define _RD0I2C_TH_MASK                                     0x3
#define _RD0I2C_PU_POSN                                     0x4
#define _RD0I2C_PU_POSITION                                 0x4
#define _RD0I2C_PU_SIZE                                     0x2
#define _RD0I2C_PU_LENGTH                                   0x2
#define _RD0I2C_PU_MASK                                     0x30
#define _RD0I2C_SLEW_POSN                                   0x6
#define _RD0I2C_SLEW_POSITION                               0x6
#define _RD0I2C_SLEW_SIZE                                   0x1
#define _RD0I2C_SLEW_LENGTH                                 0x1
#define _RD0I2C_SLEW_MASK                                   0x40
#define _RD0I2C_TH0_POSN                                    0x0
#define _RD0I2C_TH0_POSITION                                0x0
#define _RD0I2C_TH0_SIZE                                    0x1
#define _RD0I2C_TH0_LENGTH                                  0x1
#define _RD0I2C_TH0_MASK                                    0x1
#define _RD0I2C_TH1_POSN                                    0x1
#define _RD0I2C_TH1_POSITION                                0x1
#define _RD0I2C_TH1_SIZE                                    0x1
#define _RD0I2C_TH1_LENGTH                                  0x1
#define _RD0I2C_TH1_MASK                                    0x2
#define _RD0I2C_PU0_POSN                                    0x4
#define _RD0I2C_PU0_POSITION                                0x4
#define _RD0I2C_PU0_SIZE                                    0x1
#define _RD0I2C_PU0_LENGTH                                  0x1
#define _RD0I2C_PU0_MASK                                    0x10
#define _RD0I2C_PU1_POSN                                    0x5
#define _RD0I2C_PU1_POSITION                                0x5
#define _RD0I2C_PU1_SIZE                                    0x1
#define _RD0I2C_PU1_LENGTH                                  0x1
#define _RD0I2C_PU1_MASK                                    0x20
#define _RD0I2C_I2CTH_POSN                                  0x0
#define _RD0I2C_I2CTH_POSITION                              0x0
#define _RD0I2C_I2CTH_SIZE                                  0x2
#define _RD0I2C_I2CTH_LENGTH                                0x2
#define _RD0I2C_I2CTH_MASK                                  0x3
#define _RD0I2C_I2CPU_POSN                                  0x4
#define _RD0I2C_I2CPU_POSITION                              0x4
#define _RD0I2C_I2CPU_SIZE                                  0x2
#define _RD0I2C_I2CPU_LENGTH                                0x2
#define _RD0I2C_I2CPU_MASK                                  0x30
#define _RD0I2C_I2CSLEW_POSN                                0x6
#define _RD0I2C_I2CSLEW_POSITION                            0x6
#define _RD0I2C_I2CSLEW_SIZE                                0x1
#define _RD0I2C_I2CSLEW_LENGTH                              0x1
#define _RD0I2C_I2CSLEW_MASK                                0x40
#define _RD0I2C_I2CTH0_POSN                                 0x0
#define _RD0I2C_I2CTH0_POSITION                             0x0
#define _RD0I2C_I2CTH0_SIZE                                 0x1
#define _RD0I2C_I2CTH0_LENGTH                               0x1
#define _RD0I2C_I2CTH0_MASK                                 0x1
#define _RD0I2C_I2CTH1_POSN                                 0x1
#define _RD0I2C_I2CTH1_POSITION                             0x1
#define _RD0I2C_I2CTH1_SIZE                                 0x1
#define _RD0I2C_I2CTH1_LENGTH                               0x1
#define _RD0I2C_I2CTH1_MASK                                 0x2
#define _RD0I2C_I2CPU0_POSN                                 0x4
#define _RD0I2C_I2CPU0_POSITION                             0x4
#define _RD0I2C_I2CPU0_SIZE                                 0x1
#define _RD0I2C_I2CPU0_LENGTH                               0x1
#define _RD0I2C_I2CPU0_MASK                                 0x10
#define _RD0I2C_I2CPU1_POSN                                 0x5
#define _RD0I2C_I2CPU1_POSITION                             0x5
#define _RD0I2C_I2CPU1_SIZE                                 0x1
#define _RD0I2C_I2CPU1_LENGTH                               0x1
#define _RD0I2C_I2CPU1_MASK                                 0x20

// Register: RD1I2C
#define RD1I2C RD1I2C
extern volatile unsigned char           RD1I2C              __at(0x3A7B);
#ifndef _LIB_BUILD
asm("RD1I2C equ 03A7Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned PU0                    :1;
        unsigned PU1                    :1;
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RD1I2Cbits_t;
extern volatile RD1I2Cbits_t RD1I2Cbits __at(0x3A7B);
// bitfield macros
#define _RD1I2C_TH_POSN                                     0x0
#define _RD1I2C_TH_POSITION                                 0x0
#define _RD1I2C_TH_SIZE                                     0x2
#define _RD1I2C_TH_LENGTH                                   0x2
#define _RD1I2C_TH_MASK                                     0x3
#define _RD1I2C_PU_POSN                                     0x4
#define _RD1I2C_PU_POSITION                                 0x4
#define _RD1I2C_PU_SIZE                                     0x2
#define _RD1I2C_PU_LENGTH                                   0x2
#define _RD1I2C_PU_MASK                                     0x30
#define _RD1I2C_SLEW_POSN                                   0x6
#define _RD1I2C_SLEW_POSITION                               0x6
#define _RD1I2C_SLEW_SIZE                                   0x1
#define _RD1I2C_SLEW_LENGTH                                 0x1
#define _RD1I2C_SLEW_MASK                                   0x40
#define _RD1I2C_TH0_POSN                                    0x0
#define _RD1I2C_TH0_POSITION                                0x0
#define _RD1I2C_TH0_SIZE                                    0x1
#define _RD1I2C_TH0_LENGTH                                  0x1
#define _RD1I2C_TH0_MASK                                    0x1
#define _RD1I2C_TH1_POSN                                    0x1
#define _RD1I2C_TH1_POSITION                                0x1
#define _RD1I2C_TH1_SIZE                                    0x1
#define _RD1I2C_TH1_LENGTH                                  0x1
#define _RD1I2C_TH1_MASK                                    0x2
#define _RD1I2C_PU0_POSN                                    0x4
#define _RD1I2C_PU0_POSITION                                0x4
#define _RD1I2C_PU0_SIZE                                    0x1
#define _RD1I2C_PU0_LENGTH                                  0x1
#define _RD1I2C_PU0_MASK                                    0x10
#define _RD1I2C_PU1_POSN                                    0x5
#define _RD1I2C_PU1_POSITION                                0x5
#define _RD1I2C_PU1_SIZE                                    0x1
#define _RD1I2C_PU1_LENGTH                                  0x1
#define _RD1I2C_PU1_MASK                                    0x20
#define _RD1I2C_I2CTH_POSN                                  0x0
#define _RD1I2C_I2CTH_POSITION                              0x0
#define _RD1I2C_I2CTH_SIZE                                  0x2
#define _RD1I2C_I2CTH_LENGTH                                0x2
#define _RD1I2C_I2CTH_MASK                                  0x3
#define _RD1I2C_I2CPU_POSN                                  0x4
#define _RD1I2C_I2CPU_POSITION                              0x4
#define _RD1I2C_I2CPU_SIZE                                  0x2
#define _RD1I2C_I2CPU_LENGTH                                0x2
#define _RD1I2C_I2CPU_MASK                                  0x30
#define _RD1I2C_I2CSLEW_POSN                                0x6
#define _RD1I2C_I2CSLEW_POSITION                            0x6
#define _RD1I2C_I2CSLEW_SIZE                                0x1
#define _RD1I2C_I2CSLEW_LENGTH                              0x1
#define _RD1I2C_I2CSLEW_MASK                                0x40
#define _RD1I2C_I2CTH0_POSN                                 0x0
#define _RD1I2C_I2CTH0_POSITION                             0x0
#define _RD1I2C_I2CTH0_SIZE                                 0x1
#define _RD1I2C_I2CTH0_LENGTH                               0x1
#define _RD1I2C_I2CTH0_MASK                                 0x1
#define _RD1I2C_I2CTH1_POSN                                 0x1
#define _RD1I2C_I2CTH1_POSITION                             0x1
#define _RD1I2C_I2CTH1_SIZE                                 0x1
#define _RD1I2C_I2CTH1_LENGTH                               0x1
#define _RD1I2C_I2CTH1_MASK                                 0x2
#define _RD1I2C_I2CPU0_POSN                                 0x4
#define _RD1I2C_I2CPU0_POSITION                             0x4
#define _RD1I2C_I2CPU0_SIZE                                 0x1
#define _RD1I2C_I2CPU0_LENGTH                               0x1
#define _RD1I2C_I2CPU0_MASK                                 0x10
#define _RD1I2C_I2CPU1_POSN                                 0x5
#define _RD1I2C_I2CPU1_POSITION                             0x5
#define _RD1I2C_I2CPU1_SIZE                                 0x1
#define _RD1I2C_I2CPU1_LENGTH                               0x1
#define _RD1I2C_I2CPU1_MASK                                 0x20

