GopalSaraf/Practicals/PSDL/include/proc/pic18lf46k42.h
// Register: SMT1CPR
#define SMT1CPR SMT1CPR
#ifndef __CCI__
extern volatile __uint24                SMT1CPR             __at(0x3F15);
#endif
#ifndef _LIB_BUILD
asm("SMT1CPR equ 03F15h");
#endif

// Register: SMT1CPRL
#define SMT1CPRL SMT1CPRL
extern volatile unsigned char           SMT1CPRL            __at(0x3F15);
#ifndef _LIB_BUILD
asm("SMT1CPRL equ 03F15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPR                    :8;
    };
    struct {
        unsigned CPR0                   :1;
        unsigned CPR1                   :1;
        unsigned CPR2                   :1;
        unsigned CPR3                   :1;
        unsigned CPR4                   :1;
        unsigned CPR5                   :1;
        unsigned CPR6                   :1;
        unsigned CPR7                   :1;
    };
    struct {
        unsigned SMT1CPR                :8;
    };
    struct {
        unsigned SMT1CPR0               :1;
        unsigned SMT1CPR1               :1;
        unsigned SMT1CPR2               :1;
        unsigned SMT1CPR3               :1;
        unsigned SMT1CPR4               :1;
        unsigned SMT1CPR5               :1;
        unsigned SMT1CPR6               :1;
        unsigned SMT1CPR7               :1;
    };
} SMT1CPRLbits_t;
extern volatile SMT1CPRLbits_t SMT1CPRLbits __at(0x3F15);
// bitfield macros
#define _SMT1CPRL_CPR_POSN                                  0x0
#define _SMT1CPRL_CPR_POSITION                              0x0
#define _SMT1CPRL_CPR_SIZE                                  0x8
#define _SMT1CPRL_CPR_LENGTH                                0x8
#define _SMT1CPRL_CPR_MASK                                  0xFF
#define _SMT1CPRL_CPR0_POSN                                 0x0
#define _SMT1CPRL_CPR0_POSITION                             0x0
#define _SMT1CPRL_CPR0_SIZE                                 0x1
#define _SMT1CPRL_CPR0_LENGTH                               0x1
#define _SMT1CPRL_CPR0_MASK                                 0x1
#define _SMT1CPRL_CPR1_POSN                                 0x1
#define _SMT1CPRL_CPR1_POSITION                             0x1
#define _SMT1CPRL_CPR1_SIZE                                 0x1
#define _SMT1CPRL_CPR1_LENGTH                               0x1
#define _SMT1CPRL_CPR1_MASK                                 0x2
#define _SMT1CPRL_CPR2_POSN                                 0x2
#define _SMT1CPRL_CPR2_POSITION                             0x2
#define _SMT1CPRL_CPR2_SIZE                                 0x1
#define _SMT1CPRL_CPR2_LENGTH                               0x1
#define _SMT1CPRL_CPR2_MASK                                 0x4
#define _SMT1CPRL_CPR3_POSN                                 0x3
#define _SMT1CPRL_CPR3_POSITION                             0x3
#define _SMT1CPRL_CPR3_SIZE                                 0x1
#define _SMT1CPRL_CPR3_LENGTH                               0x1
#define _SMT1CPRL_CPR3_MASK                                 0x8
#define _SMT1CPRL_CPR4_POSN                                 0x4
#define _SMT1CPRL_CPR4_POSITION                             0x4
#define _SMT1CPRL_CPR4_SIZE                                 0x1
#define _SMT1CPRL_CPR4_LENGTH                               0x1
#define _SMT1CPRL_CPR4_MASK                                 0x10
#define _SMT1CPRL_CPR5_POSN                                 0x5
#define _SMT1CPRL_CPR5_POSITION                             0x5
#define _SMT1CPRL_CPR5_SIZE                                 0x1
#define _SMT1CPRL_CPR5_LENGTH                               0x1
#define _SMT1CPRL_CPR5_MASK                                 0x20
#define _SMT1CPRL_CPR6_POSN                                 0x6
#define _SMT1CPRL_CPR6_POSITION                             0x6
#define _SMT1CPRL_CPR6_SIZE                                 0x1
#define _SMT1CPRL_CPR6_LENGTH                               0x1
#define _SMT1CPRL_CPR6_MASK                                 0x40
#define _SMT1CPRL_CPR7_POSN                                 0x7
#define _SMT1CPRL_CPR7_POSITION                             0x7
#define _SMT1CPRL_CPR7_SIZE                                 0x1
#define _SMT1CPRL_CPR7_LENGTH                               0x1
#define _SMT1CPRL_CPR7_MASK                                 0x80
#define _SMT1CPRL_SMT1CPR_POSN                              0x0
#define _SMT1CPRL_SMT1CPR_POSITION                          0x0
#define _SMT1CPRL_SMT1CPR_SIZE                              0x8
#define _SMT1CPRL_SMT1CPR_LENGTH                            0x8
#define _SMT1CPRL_SMT1CPR_MASK                              0xFF
#define _SMT1CPRL_SMT1CPR0_POSN                             0x0
#define _SMT1CPRL_SMT1CPR0_POSITION                         0x0
#define _SMT1CPRL_SMT1CPR0_SIZE                             0x1
#define _SMT1CPRL_SMT1CPR0_LENGTH                           0x1
#define _SMT1CPRL_SMT1CPR0_MASK                             0x1
#define _SMT1CPRL_SMT1CPR1_POSN                             0x1
#define _SMT1CPRL_SMT1CPR1_POSITION                         0x1
#define _SMT1CPRL_SMT1CPR1_SIZE                             0x1
#define _SMT1CPRL_SMT1CPR1_LENGTH                           0x1
#define _SMT1CPRL_SMT1CPR1_MASK                             0x2
#define _SMT1CPRL_SMT1CPR2_POSN                             0x2
#define _SMT1CPRL_SMT1CPR2_POSITION                         0x2
#define _SMT1CPRL_SMT1CPR2_SIZE                             0x1
#define _SMT1CPRL_SMT1CPR2_LENGTH                           0x1
#define _SMT1CPRL_SMT1CPR2_MASK                             0x4
#define _SMT1CPRL_SMT1CPR3_POSN                             0x3
#define _SMT1CPRL_SMT1CPR3_POSITION                         0x3
#define _SMT1CPRL_SMT1CPR3_SIZE                             0x1
#define _SMT1CPRL_SMT1CPR3_LENGTH                           0x1
#define _SMT1CPRL_SMT1CPR3_MASK                             0x8
#define _SMT1CPRL_SMT1CPR4_POSN                             0x4
#define _SMT1CPRL_SMT1CPR4_POSITION                         0x4
#define _SMT1CPRL_SMT1CPR4_SIZE                             0x1
#define _SMT1CPRL_SMT1CPR4_LENGTH                           0x1
#define _SMT1CPRL_SMT1CPR4_MASK                             0x10
#define _SMT1CPRL_SMT1CPR5_POSN                             0x5
#define _SMT1CPRL_SMT1CPR5_POSITION                         0x5
#define _SMT1CPRL_SMT1CPR5_SIZE                             0x1
#define _SMT1CPRL_SMT1CPR5_LENGTH                           0x1
#define _SMT1CPRL_SMT1CPR5_MASK                             0x20
#define _SMT1CPRL_SMT1CPR6_POSN                             0x6
#define _SMT1CPRL_SMT1CPR6_POSITION                         0x6
#define _SMT1CPRL_SMT1CPR6_SIZE                             0x1
#define _SMT1CPRL_SMT1CPR6_LENGTH                           0x1
#define _SMT1CPRL_SMT1CPR6_MASK                             0x40
#define _SMT1CPRL_SMT1CPR7_POSN                             0x7
#define _SMT1CPRL_SMT1CPR7_POSITION                         0x7
#define _SMT1CPRL_SMT1CPR7_SIZE                             0x1
#define _SMT1CPRL_SMT1CPR7_LENGTH                           0x1
#define _SMT1CPRL_SMT1CPR7_MASK                             0x80

